<h2>Soal 1: Penggabungan Data</h2>

- Sebutkan perbedaan antara full outer join, inner join, dan left join

Jawab:
outer join adalah seubuah pergabungan data baris dari setiap data yang digabungkan
inner join adalah sebuah pergabungan data baris yang beririsan
left join adalah sebuah penggabungan yang menghasilkan seluruh data dari data yang kiri ditambah yang kanan

<h2>Soal 2: Penggabungan Data</h2>

Pada quiz no 2 ini gunakan data [names1881.csv](https://drive.google.com/uc?export=download&id=1Pwu3cv93hI79jmi52kJ05xhophknDKat) dan [names1981.csv](https://drive.google.com/uc?export=download&id=1pvsGaybr423hJXcN35e5nS3sg4ha4jo3), data ini berisi nama bayi yang lahir pada tahun 1881 atau 1981 di Amerika.

- Baca data tersebut dengan memberikan nama column 'Name', 'Gender', 'Count'.
- Tunjukan jumlah dimensi dari data 'names1881.csv' dan 'names1981.csv'
- Gabungkan kedua data tersebut berdasarkan sumbu baris
- Tunjukan jumlah dimensi dari data setelah di gabungkan.

In [13]:
import pandas as pd
# read data
df1 = pd.read_csv('names1881.csv',names=['Name','Gender','Count'])
df2 = pd.read_csv('names1981.csv',names=['Name','Gender','Count'])

# periksa dimensi dari kedua data
print("Jumlah Dimensi data 'names1881.csv' :")
print(df1.shape)
print(df1)
print("Jumlah dimensi baris data 'names1981.csv' :")
print(df2.shape)
print(df2)

# gabungkan data
print("Jumlah Baris data 'names1981.csv' :")
joined = [df1,df2]
df = pd.concat(joined)
print(df)

# periksa dimensi data hasil gabungan
print("Jumlah dimensi data setelah penggabungan : ")
print(df.shape)

Jumlah Dimensi data 'names1881.csv' :
(1935, 3)
            Name Gender  Count
0           Mary      F   6919
1           Anna      F   2698
2           Emma      F   2034
3      Elizabeth      F   1852
4       Margaret      F   1658
5         Minnie      F   1653
6            Ida      F   1439
7          Annie      F   1326
8         Bertha      F   1324
9          Alice      F   1308
10         Clara      F   1242
11         Sarah      F   1226
12          Ella      F   1148
13        Nellie      F   1096
14         Grace      F   1089
15      Florence      F   1046
16        Martha      F   1044
17          Cora      F    969
18         Laura      F    962
19        Carrie      F    958
20         Maude      F    923
21        Bessie      F    903
22         Mabel      F    893
23      Gertrude      F    791
24         Ethel      F    788
25        Jennie      F    784
26         Edith      F    778
27        Hattie      F    775
28        Mattie      F    754
29         Julia      F    737
...          ...    ...    ...
1905      Mercer      M      5
1906       Monte      M      5
1907  Montgomery      M      5
1908       Nolan      M      5
1909        Okey      M      5
1910       Orley      M      5
1911        Page      M      5
1912       Philo      M      5
1913      Primus      M      5
1914     Prosper      M      5
1915       Pryor      M      5
1916        Rene      M      5
1917       Robin      M      5
1918        Roll      M      5
1919     Rolland      M      5
1920      Seward      M      5
1921     Shannon      M      5
1922     Talmage      M      5
1923       Urban      M      5
1924      Vaughn      M      5
1925      Verner      M      5
1926     Waverly      M      5
1927     Webster      M      5
1928      Weldon      M      5
1929       Wells      M      5
1930      Wiliam      M      5
1931      Wilton      M      5
1932        Wing      M      5
1933        Wood      M      5
1934      Wright      M      5

[1935 rows x 3 columns]
Jumlah dimensi baris data 'names1981.csv' :
(19455, 3)
             Name Gender  Count
0        Jennifer      F  57032
1         Jessica      F  42519
2          Amanda      F  34370
3           Sarah      F  28162
4         Melissa      F  28003
5             Amy      F  20337
6          Nicole      F  20310
7       Stephanie      F  20202
8       Elizabeth      F  20168
9         Heather      F  17941
10       Michelle      F  17764
11        Rebecca      F  16730
12       Kimberly      F  16690
13        Tiffany      F  16409
14         Angela      F  15912
15        Crystal      F  15881
16      Christina      F  14391
17           Lisa      F  14291
18           Erin      F  13848
19          Amber      F  13808
20          Laura      F  13288
21         Rachel      F  12583
22          Kelly      F  11875
23         Andrea      F  11678
24          April      F  11402
25           Sara      F  11350
26           Mary      F  11030
27          Jamie      F  10978
28          Emily      F  10800
29       Danielle      F  10028
...           ...    ...    ...
19425  Willington      M      5
19426    Wladimir      M      5
19427         Won      M      5
19428         Woo      M      5
19429     Woodley      M      5
19430        Xeng      M      5
19431      Yannis      M      5
19432         Yaw      M      5
19433         Yia      M      5
19434     Yiannis      M      5
19435       Yohei      M      5
19436        Yoni      M      5
19437          Yu      M      5
19438         Yul      M      5
19439      Yusuke      M      5
19440        Yvan      M      5
19441      Yvette      M      5
19442    Zaccheus      M      5
19443     Zachari      M      5
19444    Zacharie      M      5
19445     Zackory      M      5
19446       Zaire      M      5
19447    Zakariah      M      5
19448        Zayd      M      5
19449         Zed      M      5
19450    Zeferino      M      5
19451     Zerrick      M      5
19452    Zimbabwe      M      5
19453      Zoltan      M      5
19454      Zuriel      M      5

[19455 rows x 3 columns]
Jumlah Baris data 'names1981.csv' :
             Name Gender  Count
0            Mary      F   6919
1            Anna      F   2698
2            Emma      F   2034
3       Elizabeth      F   1852
4        Margaret      F   1658
5          Minnie      F   1653
6             Ida      F   1439
7           Annie      F   1326
8          Bertha      F   1324
9           Alice      F   1308
10          Clara      F   1242
11          Sarah      F   1226
12           Ella      F   1148
13         Nellie      F   1096
14          Grace      F   1089
15       Florence      F   1046
16         Martha      F   1044
17           Cora      F    969
18          Laura      F    962
19         Carrie      F    958
20          Maude      F    923
21         Bessie      F    903
22          Mabel      F    893
23       Gertrude      F    791
24          Ethel      F    788
25         Jennie      F    784
26          Edith      F    778
27         Hattie      F    775
28         Mattie      F    754
29          Julia      F    737
...           ...    ...    ...
19425  Willington      M      5
19426    Wladimir      M      5
19427         Won      M      5
19428         Woo      M      5
19429     Woodley      M      5
19430        Xeng      M      5
19431      Yannis      M      5
19432         Yaw      M      5
19433         Yia      M      5
19434     Yiannis      M      5
19435       Yohei      M      5
19436        Yoni      M      5
19437          Yu      M      5
19438         Yul      M      5
19439      Yusuke      M      5
19440        Yvan      M      5
19441      Yvette      M      5
19442    Zaccheus      M      5
19443     Zachari      M      5
19444    Zacharie      M      5
19445     Zackory      M      5
19446       Zaire      M      5
19447    Zakariah      M      5
19448        Zayd      M      5
19449         Zed      M      5
19450    Zeferino      M      5
19451     Zerrick      M      5
19452    Zimbabwe      M      5
19453      Zoltan      M      5
19454      Zuriel      M      5

[21390 rows x 3 columns]
Jumlah dimensi data setelah penggabungan :
(21390, 3)

Expected Result: 

Jumlah Dimensi data 'names1881.csv': 

(1935, 3)

Jumlah Baris data 'names1981.csv':

(19455, 3)

![alt text](https://drive.google.com/uc?id=1jMCAdLrcJubjufydZBnzdQkYqDS3Klat)

Jumlah dimensi data setelah penggabungan : 

(21390, 3)

<h2>Soal 3: Penggabungan Data</h2>

Lakukan jenis penggabungan data full outer join, inner join, left outer join dan right outer join pada kedua data berikut:

In [14]:
import pandas as pd

data1 = {
    'id' : [1, 2, 3, 4],
    'Feature1' : ['a1', 'a2', 'a3', 'a4'],
    'Feature2' : ['b1', 'b2', 'b3', 'b4']
}

data2 = {
    'id' : [3, 4, 5 ,6, 7],
    'Feature3' : ['c1', 'c2', 'c3', 'c4', 'c5']
}

df1= pd.DataFrame(data1)
df2= pd.DataFrame(data2)

print(df1)
print(df2)

  Feature1 Feature2  id
0       a1       b1   1
1       a2       b2   2
2       a3       b3   3
3       a4       b4   4
  Feature3  id
0       c1   3
1       c2   4
2       c3   5
3       c4   6
4       c5   7

In [22]:
# join data
df_outer_join = pd.merge(df1,df2,on='id',how='outer')
print(df_outer_join)

df_inner_join = pd.merge(df1,df2,on='id',how='inner')
print(df_inner_join)

df_left_join = pd.merge(df1,df2,on='id',how='left')
print(df_left_join)

df_right_join = pd.merge(df1,df2,on='id',how='right')
print(df_right_join)

  Feature1 Feature2  id Feature3
0       a1       b1   1      NaN
1       a2       b2   2      NaN
2       a3       b3   3       c1
3       a4       b4   4       c2
4      NaN      NaN   5       c3
5      NaN      NaN   6       c4
6      NaN      NaN   7       c5
  Feature1 Feature2  id Feature3
0       a3       b3   3       c1
1       a4       b4   4       c2
  Feature1 Feature2  id Feature3
0       a1       b1   1      NaN
1       a2       b2   2      NaN
2       a3       b3   3       c1
3       a4       b4   4       c2
  Feature1 Feature2  id Feature3
0       a3       b3   3       c1
1       a4       b4   4       c2
2      NaN      NaN   5       c3
3      NaN      NaN   6       c4
4      NaN      NaN   7       c5

Expected Result:

![alt text](https://drive.google.com/uc?id=1kUpkzWh3Y-X_1H1QXHiccdHf4YjqXsDu)

![alt text](https://drive.google.com/uc?id=1ojoAC2oX9P3ZHl0lS3RXipd7gShLOmmC)

![alt text](https://drive.google.com/uc?id=12jDnQzIosn6dizVwl2nPMX1IhhyEZ4FA)

![alt text](https://drive.google.com/uc?id=11znqscNsVZ-cHY-PPgoHEBDWyc6XRtAL)

<h2>Soal 4: Penggabungan Data berbeda label column Key</h2>

Lakukan jenis penggabungan inner join untuk 2 data yang memiliki nama column key yang berbeda ini:

In [24]:
data1 = {
    'key_data1' : [1, 2, 3, 4],
    'Feature1' : ['a1', 'a2', 'a3', 'a4'],
    'Feature2' : ['b1', 'b2', 'b3', 'b4']
}

data2 = {
    'key_data2' : [3, 4, 5 ,6, 7],
    'Feature3' : ['c1', 'c2', 'c3', 'c4', 'c5']
}

df1= pd.DataFrame(data1)
df2= pd.DataFrame(data2)

print(df1)
print(df2)

  Feature1 Feature2  key_data1
0       a1       b1          1
1       a2       b2          2
2       a3       b3          3
3       a4       b4          4
  Feature3  key_data2
0       c1          3
1       c2          4
2       c3          5
3       c4          6
4       c5          7

In [25]:
# Gabungkan kedua data tersebut
df_gabung = pd.merge(df1,df2,left_on='key_data1',right_on='key_data2',how='inner')

df_gabung

  Feature1 Feature2  key_data1 Feature3  key_data2
0       a3       b3          3       c1          3
1       a4       b4          4       c2          4

Expected Result:

![alt text](https://drive.google.com/uc?id=1uBiVOPnqns4al88FDc0ENIeTzIxP4wxH)